## [DataFrame 인덱스 다루기]

(1) 모듈로딩

In [1]:
import pandas as pd

(2) 데이터 준비

In [2]:
#dict 타입의 데이터 생성
exam={'이름':['마징가','배트맨','홍길동','임꺽정'],
      '국어':[ 98,79,99,100],
       '미술':[ 70,99,87,80],
       '수학':[ 98,70,100,72],
       '체육':[ 80,93,69,91] }

(3)DataFrame에 데이터 저장

In [3]:
examDF=pd.DataFrame(exam)

- (4) 데이터 확인

In [4]:
examDF

    이름   국어  미술   수학  체육
0  마징가   98  70   98  80
1  배트맨   79  99   70  93
2  홍길동   99  87  100  69
3  임꺽정  100  80   72  91

- (5) 새로운 인덱스 설정 : 방법1. 인덱스 일부 변경 DF.rename()

In [5]:
#행 인덱스 일부 변경=>{기존 인덱스:새로운 인덱스}
#inplace 매개변수/파라미터=> 원본 DataFrame에 변경 여부 결정, 기본은 원본 변경 안함 False
examDF.rename(index={0:'zero'},inplace=True) # 한번 더 설명! inplace는 원본을 안바꾸는 false가 기본값이며 ,원본을 바꾸려면 true, 그떄의 반환값은 x

In [6]:
examDF

       이름   국어  미술   수학  체육
zero  마징가   98  70   98  80
1     배트맨   79  99   70  93
2     홍길동   99  87  100  69
3     임꺽정  100  80   72  91

In [7]:
# 열 이름 인덱스 일부 변경=> column={기존인덱스:새로운인덱스}
examDF.rename(columns={'체육':'음악'},inplace=True)

In [8]:
examDF.columns

Index(['이름', '국어', '미술', '수학', '음악'], dtype='object')

- (5) 새로운 인덱스 설정 - 방법2: 특정 컬럼=> 인덱스:DF.set_index()

In [9]:
# 현재 기본 0 ~ ===> 이름 컬럼 인덱스로 설정
examDF.index

Index(['zero', 1, 2, 3], dtype='object')

In [10]:
#1개 컬럼을 행 인덱스 설정
examDF2=examDF.set_index('이름')
examDF2.index

Index(['마징가', '배트맨', '홍길동', '임꺽정'], dtype='object', name='이름')

In [11]:
#2개 컬럼을 행 인덱스 설정 단, inplace 파라메터가 False 로 원본에 적용 안됨!
examDF3=examDF.set_index(['이름','국어','수학'])
examDF3.index

MultiIndex([('마징가',  98,  98),
            ('배트맨',  79,  70),
            ('홍길동',  99, 100),
            ('임꺽정', 100,  72)],
           names=['이름', '국어', '수학'])

In [12]:
examDF3.loc[('마징가',98,98)]
# 온전한 멀티 인덱스를 넣으면 시리즈 형태로 출력

미술    70
음악    80
Name: (마징가, 98, 98), dtype: int64

In [13]:
examDF3.loc['마징가']
#이런 식으로 한개만 친다면, 데이터 프레임 형식으로 멀티 인덱스까지 같이 출력되어 버린다.

       미술  음악
국어 수학
98 98  70  80

In [14]:
# examDF3.loc[('마징가',98)]

In [15]:
#keyError=> '마징가',98,98 형식으로 98로 시작하는 Key없음
# examDF3.loc[(98,98)]
# 안됨......

- (5) 새로운 인덱스 설정 방법3:

In [16]:
examDF.set_index('이름',inplace=True)

In [17]:
examDF

      국어  미술   수학  음악
이름
마징가   98  70   98  80
배트맨   79  99   70  93
홍길동   99  87  100  69
임꺽정  100  80   72  91

In [18]:
# 현재 행 인덱스=>컬럼으로 추가
examDF.reset_index()  # inplace를 사용했을때 다시 돌리고 싶을떄 씀

    이름   국어  미술   수학  음악
0  마징가   98  70   98  80
1  배트맨   79  99   70  93
2  홍길동   99  87  100  69
3  임꺽정  100  80   72  91

In [19]:
examDF.reset_index().reset_index() 
# reset 인덱스를 옆에 계속 붙이면 인덱스가 순서대로 계속 붙는다.....

   index   이름   국어  미술   수학  음악
0      0  마징가   98  70   98  80
1      1  배트맨   79  99   70  93
2      2  홍길동   99  87  100  69
3      3  임꺽정  100  80   72  91

In [20]:
#현재 행 인덱스를 컬럼에 추가하지 않고 삭제 => drop 파라미터를 True로 설정
df2=examDF.reset_index(drop=True)
df2

    국어  미술   수학  음악
0   98  70   98  80
1   79  99   70  93
2   99  87  100  69
3  100  80   72  91